["Would you rather Swim 300 meters through sh#t or dead bodies?","Would you rather Have a dog with a cat’s personality or a cat with a dog’s personality?","If you were reborn in a new life, would you rather be alive in the past or future?","Would you rather eat no candy at Halloween or no turkey at Thanksgiving?","Would you rather date someone you love or date someone who loves you?","Would you rather lose the ability to lie or believe everything you’re told?","Would you rather be free or be totally safe?","Would you rather Eat sh#t that tasted like chocolate, or eat chocolate that tasted like crap?","Would you rather Look 10 years older from the neck up, or the neck down?","Would you rather Be extremely underweight or extremely overweight?","Would you rather Experience the beginning of planet earth or the end of planet earth?","Would you rather have three kids and no money, or no kids with three million dollars?","Would you rather Be the funniest person in the room or the most intelligent?","Would you rather Have a Lamborghini in your garage or a bookcase with 9000 books and infinite knowledge?","Would you rather reverse one decision you make every day or be able to stop time for 10 seconds every day?","Would you rather Win $50,000 or let your best friend win $500,000?","Would you rather Run at 100 mph or fly at ten mph?","Would you rather Continue with your life or restart it?","Would you rather Be able to talk your way out of any situation, or punch your way out of any situation?","Would you rather Have free Wi-Fi wherever you go or have free coffee where/whenever you want?","Would you rather have seven fingers on each hand or have seven toes on each foot?","Would you rather live low life with your loved one or rich life all alone?","Would you rather Have no one to show up for your Wedding or your funeral?","Would you rather Rule the World or live in a World with absolutely no problems at all?","Would you rather go back to the past and meet your loved ones who passed away or go to the future to meet your children or grandchildren to be?","Would you rather speak your mind or never speak again?","Would you rather live the life of a king with no family or friends or live like a vagabond with your friends or family?","Would you rather know how you will die or when you will die?","Would you rather speak all languages or be able to speak to all animals?","Would you rather get away with lying every time or always know that someone is lying?","Would you rather eat your dead friend or kill your dog and eat it when you are marooned on a lonely island?","Would you rather Have a billion dollars to your name or spend $1000 for each hungry and homeless person?","Would you rather End death due to car accidents or end terrorism?","Would you rather Leave your unemployed son homeless or pay for his dr#g habits and illegal activities?","Would you rather end the life of a human being or 100 cute baby animals?","Would you rather End hunger or end your hunger?","Would you rather Skinny dip with your classmate or with a stranger?","Would you rather give up your love life or work life?","Would you rather live in an amusement park or a zoo?","Would you rather be a millionaire by winning the lottery or by working 100 hours a week?","Would you rather read minds or accurately predict the future?","Would you rather eat only pizza for 1 year or eat no pizza for 1 year?","Would you rather visit 100 years in the past or 100 years in the future?","Would you rather Be a cow or a chicken?","Would you rather have no taste buds or be color blind?","Would you rather Eat everything you see or lick everything you see?","Would you rather Have a foot long nose or a foot-long tongue?","Would you rather Have a baby at 10 or a baby at 60?","Would you rather Be in jail for ten years or be in a coma for 20 years?","Would you rather Have no brother or no sister?","Would you rather Be invisible or be fast?","Would you rather Look like a fish or smell like a fish?","Would you rather Play on Minecraft or play FIFA?","Would you rather Fight 100 duck-sized horses or 1 horse-sized duck?","Would you rather Have a grapefruit-sized head or a head the size of a watermelon?","Would you rather Be a tree or have to live in a tree for the rest of your life?","Would you rather Live in space or under the sea?","Would you rather lose your sense of touch or your sense of smell?","Would you rather be Donald Trump or George Bush?","Would you rather Have no hair or be completely hairy?","Would you rather wake up in the morning looking like a giraffe or a kangaroo?","Would you rather have a booger hanging from your nose for the rest of your life or earwax planted on your earlobes?","Would you rather Have a sumo wrestler on top of you or yourself on top of him?","Would you rather Be able to choose your bridesmaid dress or never have to be a bridesmaid again?","Would you rather Have your gynaecologist use a speculum that is too large or a speculum that is cold?","Would you rather Have girl’s night with Oprah Winfrey or Hillary Clinton?","Would you rather never have painful cramps again or never have to shave again?","Would you rather Be catcalled or be treated like a human being?","Would you rather Go through a whole day with a very visible panty line or with lipstick on your teeth?","Would you rather Be asked if you are PMSing every single day or be told to stop being so sensitive every day?","Would you rather wear a push-up bra all day long or stiletto heels all day long?","Would you rather Have an entire eyebrow accidentally waxed off or Get a rash from a poor bikini wax job?","Would you rather get your period at the beach or on a date?","Would you rather Live in a world without the movie “Bridesmaids” or without “Mean Girls”?","Would you rather Have an awful hair day or go through the whole day with your bra’s underwire poking you?","Suggested: The Hardest Would You Rather Questions for Girls","Would you rather Wear a pad for 12 hours or wear a thong that keeps creeping up into your bits?","Would you rather have tampons for fingers or have pubic hair for teeth.","Would you rather love your spouse or be loved by your spouse?","Would you rather make out on your first date or wait for the right time?","Would you rather have physical intimacy or no true love?","Would you rather have large assets and a disfigured body or have smaller assets with a fantastic body?","Would you rather not put on makeup again or not look at yourself again?","Would you rather have your menstrual cycle on your first night or your honeymoon?","Would you rather get with your boss to get promoted or give up the promotion?","Would you rather be the subject matter of gossip or never being talked about at all?","Would you rather be married to someone extremely attractive or be someone who is extremely attractive?","Would you rather Kiss a girl or be kissed by a girl? (via)","Would you rather Have a long-term relationship or flings?","Would you rather Have an average girl with a great personality or a hot girl?","Would you rather Stay in or go out for a date?","Would you rather Check out a girl from the back or the front?","Would you rather wear comfortable clothes or fashionable clothes?","Would you rather Go to a bar, a club, a house party, or just stay home?","Would you rather find true love or be rich?","Would you rather see a girl in shorts, or in a skirt?","Would you rather spend $5,000 on travelling or on a physical item like a TV?","Would you rather Not brush your teeth for ten days or not shower for ten days?","Would you rather Kiss a girl on the first date or wait?","Would you rather Be a tutor for underprivileged kids or volunteer at a homeless shelter?","Would you rather date me or be my friend?","Would you rather Go to an expensive restaurant or a cheaper relaxed atmosphere where the food is equally good?","Would you rather weave a web of lies for your girlfriend or tell her the whole truth?","Would you rather continue your relationship or leave if you find your girlfriend is diagnosed with a terminally fatal disease?","Would you rather eat the food prepared by your mom or your girlfriend?","Would you rather take your girlfriend out for a date or snuggle her in your arms and stay indoors?","Would you rather see your girlfriend with or without makeup?","Would you rather leave your girlfriend if she is not good in bed or continue living with her?","Would you rather sleep with your girlfriend or get paid $10000 not to?","Would you rather have an obsessed girlfriend or a hot, cheating one?","Would you rather Be poor and good looking or wealthy and ugly? (via)","Would you rather Be hairy or completely bald?","Would you rather Be 4’5″ or 7’7″?","Would you rather Be blind or deaf?","Would you rather Be short and well-built or tall but fat?","Would you rather take a guaranteed $100,000 or a 50/50 chance at $1,000,000?","Would you rather eat healthily or exercise regularly?","Would you rather Be super strong or super fast?","Would you rather Be poor and find true love or be rich?","Would you rather lose half your hair or lose half your hearing?","Would you rather work hard at the job you love or slack off at a boring job?","Would you rather Look weak and be strong or look strong and be weak?","Would you rather Have a third wrist or a third eye?","Would you rather Be as wide as you are tall, or as tall as you are wide?","Would you rather age from the neck up or the neck down only?","Would you rather join the army or be an athlete?","Would you rather go on a free, fully paid dream vacation or be with someone you love in your home?","Would you rather be the richest person in the World or the smartest?","Would you rather own your dream car or have never-ending knowledge?","Would you rather create history or delete it?","Would you rather have a high profile job with no family for life or an average job with a family to live by?","Would you rather grab the front or the back of a girl when invisible?","Would you rather eat an entire stick of butter or send an embarrassing email to your entire company?","Would you rather Be stung by a jellyfish or give up Facebook for a week?","Would you rather Never have internet access or be a professional clown?","Would you rather Create a super successful app or go on tour with Beyoncé?","Would you rather not use email for a week or feel hungover for a week?","Would you rather have an iPod fitted in your mind and listen to any music of your choice, anytime or watch your dreams alive on television?","Would you rather give up search engines or social media applications?","Would you rather play Minecraft or Super Mario?","Would you rather have a lifelong free subscription to Apple Music or Spotify?","Would you rather have free internet for life or free food?","Would you rather live without a cell phone or news?","Would you rather have your brain transplanted into a robot or an animal of your choice?","Would you rather have infinite battery life for your cell phone or infinite fuel for your car?","Would you rather burn all your books or buy a Kindle or an eBook reader?","Would you rather surf the internet or shop till you drop?","Would you rather give up your snazzy home theater or your PlayStation?","Would you rather Stop using YouTube or stop using Instagram? (via)","Would you rather check your email first every morning or check your social media first every morning?","Would you rather lose your keys or forget your cell phone?","Would you rather Only have access to YouTube on the Internet or only have access to games on the Internet?","Would you rather eat the same food for the rest of your life or never use Instagram again?","Would you rather watch TV all the time or not watch TV at all?","Would you rather Have slow but unlimited internet or Paid but Limited Internet?","Would you rather Give up shopping for three or give up emoji for three months?","Would you rather lose all your contacts or lose $1000?","Would you rather Ride on an elephant or a giraffe?","Would you rather eat a whole cake or a box of ice cream?","Would you rather Go sledging on a cold day or swimming on a hot day?","Would you rather Be able to fly or be as strong as your favourite superhero?","Would you rather Make the table or clean up your toys?","Would you rather Eat a chocolate kiss or a lollipop?","Would you rather Go to the aquarium or the zoo?","Would you rather play the trumpet or the flute?","Would you rather ride in a convertible or on the back of a motorcycle?","Would you rather Have a pet goat or a pet chicken?","Would you rather Eat cooked spinach or cooked broccoli?","Would you rather have a cat or a dog?","Would you rather eat a donut or a cookie?","Would you rather Be a teacher or a doctor?","Would you rather Be a firefighter or a police officer?","Would you rather watch a horror movie or a satire movie?","Would you rather spend your day with family or friends?","Would you rather spend $10000 on shoes or clothes?","Would you rather spit or swallow?","Would you rather lick or get licked?","Would you rather get your period on the beach or on a date?","Would you rather never have to shave again or never have to deal with cramps?","Would you rather release your diary or a film of your most embarrassing moment?","Would you rather be itchy or sticky for the rest of your life?","Would you rather listen to One Direction or Justin Beiber?","Would you rather give up Instagram or eat the same meal for the rest of your life?","Would you rather be a hopeless romantic OR hopeful unromantic?","Would you rather wear a snowsuit in the desert or be nak*d in Antarctica?","Would you rather have a good-looking, rich and dumb boyfriend or an average, poor and caring boyfriend?","Would you rather give a bad gift to your boyfriend or no gift at all?","Would you rather cook breakfast for your boyfriend and serve it on his bed or ask him to cook one?","Would you rather make a gift made by hand or purchase it from a store?","Would you rather let your partner think that you cheated or you actually cheat him?","Would you rather kiss your boyfriend in private or in public?","Would you rather have a boyfriend that everyone hates or good friends that your boyfriend hates?","Would you rather marry a total stranger or get forced to get intimate with one?"]